In [1]:
# Q.1
import pandas as pd

In [2]:
df=pd.read_csv('diabetes.csv')

In [3]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [4]:
x=df.drop('Outcome',axis=1)
y=df['Outcome']

In [6]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.3,
                                                    random_state=2022)

In [36]:
from sklearn.naive_bayes import BernoulliNB,GaussianNB
from sklearn.metrics import roc_auc_score

In [10]:
nb = BernoulliNB()
nb.fit(X_train,y_train)
y_pred_prob = nb.predict_proba(X_test)[:,1]
print(roc_auc_score(y_test, y_pred_prob))

0.5700088731144631

In [51]:
# Q.2
iris=pd.read_csv('iris.csv')

In [52]:
iris

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [65]:
iris.drop(columns='Id',inplace=True)

In [66]:
x=iris.iloc[:,0:4].values
y=iris.iloc[:,4].values

In [67]:
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.3,
                                                    random_state=2022)

In [68]:
from sklearn.tree import DecisionTreeClassifier
dtree = DecisionTreeClassifier(random_state=2022,max_depth=3)
dtree.fit(X_train,y_train)

DecisionTreeClassifier(max_depth=3, random_state=2022)

In [71]:
y_pred = dtree.predict(X_test)

In [76]:
from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,y_pred)

In [77]:
accuracy

0.9777777777777777

In [86]:
nb = GaussianNB()
nb.fit(X_train,y_train)
y_pred=nb.predict(X_test)
accuracy=accuracy_score(y_test,y_pred)
accuracy

0.9777777777777777

In [98]:
# Q.3
cancer=pd.read_csv('BreastCancer.csv')

In [99]:
dum_df = pd.get_dummies(cancer, drop_first=True)

In [100]:
X = dum_df.drop(['Code','Class_Malignant'],axis=1)
y = dum_df['Class_Malignant']
import numpy as np
df['age'].replace(np.NaN,df['age'].mean(),inplace=True)
df['embarked'].replace(np.NaN,df['embarked'].mean(),inplace=True)

In [102]:
from sklearn.model_selection import StratifiedKFold
from sklearn.model_selection import StratifiedKFold, cross_val_score
nb = GaussianNB()
nb.fit(X_train,y_train)
y_pred=nb.predict(X_test)
accuracy=accuracy_score(y_test,y_pred)
accuracy

0.9857142857142858

In [108]:
# Q.4
titanic=pd.read_csv('Titanic.csv.xls')

In [109]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [110]:
titanic.isnull().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
deck        688
dtype: int64

In [111]:
titanic.drop(['deck'],axis='columns',inplace=True)

In [112]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [114]:
titanic['sex']=titanic['sex'].map({'male':0,'female':1})

In [116]:
titanic['embarked']=titanic['embarked'].map({'S':0,'C':1,'Q':2})

In [117]:
titanic.isnull().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
dtype: int64

In [103]:
titanic.isnull().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
dtype: int64

In [118]:
titanic['embarked'].dropna()

0      0.0
1      1.0
2      0.0
3      0.0
4      0.0
      ...
886    0.0
887    0.0
888    0.0
889    1.0
890    2.0
Name: embarked, Length: 889, dtype: float64

In [119]:
titanic['age'].dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: age, Length: 714, dtype: float64

In [121]:
titanic.isnull().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
dtype: int64

In [122]:
import numpy as np
titanic['age'].replace(np.NaN,titanic['age'].mean(),inplace=True)
titanic['embarked'].replace(np.NaN,titanic['embarked'].mean(),inplace=True)

In [123]:
titanic.isnull().sum()

survived    0
pclass      0
sex         0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [124]:
x=titanic
y=titanic['survived']

In [125]:
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.3,
                                                    random_state=2022)

In [126]:
dtree = DecisionTreeClassifier(random_state=2022,max_depth=3)
dtree.fit(X_train,y_train)

DecisionTreeClassifier(max_depth=3, random_state=2022)

In [127]:
y_pred = dtree.predict(X_test)

In [128]:
accuracy=accuracy_score(y_test,y_pred)
accuracy

1.0

In [129]:
nb = BernoulliNB()
nb.fit(X_train,y_train)
y_pred_prob = nb.predict_proba(X_test)[:,1]
print(roc_auc_score(y_test, y_pred_prob))

1.0

In [72]:
#Q.5
import pandas as pd
from sklearn.naive_bayes import BernoulliNB,GaussianNB
from sklearn.model_selection import train_test_split
from sklearn.metrics import roc_auc_score

In [6]:

weather=['Sunny','Sunny','Overcast','Rainy','Rainy','Rainy','Overcast','Sunny','Sunny','Rainy','Sunny','Overcast','Overcast','Rainy']
temp=['Hot','Hot','Hot','Mild','Cool','Cool','Cool','Mild','Cool','Mild','Mild','Mild','Hot','Mild']
play=['No','No','Yes','Yes','Yes','No','Yes','No','Yes','Yes','Yes','Yes','Yes','No']

df=pd.DataFrame(list(zip(weather,temp,play)),columns=['weather','temp','play'])
df

     weather  temp play
0      Sunny   Hot   No
1      Sunny   Hot   No
2   Overcast   Hot  Yes
3      Rainy  Mild  Yes
4      Rainy  Cool  Yes
5      Rainy  Cool   No
6   Overcast  Cool  Yes
7      Sunny  Mild   No
8      Sunny  Cool  Yes
9      Rainy  Mild  Yes
10     Sunny  Mild  Yes
11  Overcast  Mild  Yes
12  Overcast   Hot  Yes
13     Rainy  Mild   No

In [7]:
dum_df=pd.get_dummies(df,drop_first=True)
dum_df

    weather_Rainy  weather_Sunny  temp_Hot  temp_Mild  play_Yes
0               0              1         1          0         0
1               0              1         1          0         0
2               0              0         1          0         1
3               1              0         0          1         1
4               1              0         0          0         1
5               1              0         0          0         0
6               0              0         0          0         1
7               0              1         0          1         0
8               0              1         0          0         1
9               1              0         0          1         1
10              0              1         0          1         1
11              0              0         0          1         1
12              0              0         1          0         1
13              1              0         0          1         0

In [8]:
X = dum_df.drop('play_Yes',axis=1)
y = dum_df["play_Yes"]

In [9]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.3,
                                                    random_state=2022)

In [10]:
nb = BernoulliNB()
nb.fit(X_train,y_train)

BernoulliNB()

In [11]:
y_pred_prob = nb.predict_proba(X_test)[:,1]
print(roc_auc_score(y_test, y_pred_prob))

0.375

In [ ]:
#Q6

In [16]:
df=pd.read_csv('Salaries.csv')

C:\Users\ak\AppData\Local\Temp\ipykernel_4404\1552745546.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv('Salaries.csv')

In [17]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [18]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [22]:
df['BasePay']=df['BasePay'].apply(lambda x:str(x).replace("Not Provided","0" ))

In [52]:
df['OvertimePay']=df['OvertimePay'].apply(lambda x:str(x).replace("Not Provided","0" ))

In [53]:
df['OtherPay']=df['OtherPay'].apply(lambda x:str(x).replace("Not Provided","0" ))

In [33]:
df['Benefits']=df['Benefits'].apply(lambda x:str(x).replace("Not Provided","0" ))

In [38]:
df['Benefits']=df['Benefits'].apply(lambda x:str(x).replace("nan","0" ))

In [39]:
df.isnull().sum()

Id                  0
EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
Agency              0
dtype: int64

In [ ]:
#df.drop(['Notes','Status'],axis=1,inplace=True)

In [54]:
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Agency,Experience
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,0,567595.43,567595.43,2011,San Francisco,11
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0,538909.28,538909.28,2011,San Francisco,11
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,0,335279.91,335279.91,2011,San Francisco,11
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,0,332343.61,332343.61,2011,San Francisco,11
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,0,326373.19,326373.19,2011,San Francisco,11
...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,San Francisco,8
148650,148651,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,San Francisco,8
148651,148652,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,San Francisco,8
148652,148653,Not provided,Not provided,0,0,0,0,0.00,0.00,2014,San Francisco,8
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,San Francisco,8

In [ ]:
#Factorplot
import seaborn as sns

sns.factorplot(x='JobTitle',y='TotalPay',data=df,kind='bar')

In [55]:
#import datetime
from datetime import date
today=date.today()
cur_year=today.year

In [56]:
df['Experience']=cur_year-df['Year']

In [103]:
df['OtherPay'].astype(float)

0         400184.25
1         137811.38
2          16452.60
3         198306.90
4         182234.59
            ...
148649         0.00
148650         0.00
148651         0.00
148652         0.00
148653      -618.13
Name: OtherPay, Length: 148654, dtype: float64

In [60]:
(df['Experience']<5).sum()

0

In [61]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Agency',
       'Experience'],
      dtype='object')